---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Structure.RebarBendingDetail
source: html/d2f857e4-e3ba-b09b-223d-f3b7a835bb74.htm
---
# RebarBendingDetail Members

Creates a new instance of a bending detail.